InformationRegisters/СтатусыЗанятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>СтатусыЗанятий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусЗанятия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗанятий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Занятие</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Занятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыЗанятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>СтатусыЗанятий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Проведено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтверждено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПодтверждено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перенесено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроведеноИОплачено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/СтатусыЗанятий/Ext/ManagerModule.bsl
Функция ПолучитьСтатусЗанятия(Занятие) Экспорт
	
	Запрос = Новый Запрос ("ВЫБРАТЬ
	                       |	СтатусыЗанятий.СтатусЗанятия
	                       |ИЗ
	                       |	РегистрСведений.СтатусыЗанятий КАК СтатусыЗанятий
	                       |ГДЕ
	                       |	СтатусыЗанятий.Занятие = &Занятие");
	Запрос.УстановитьПараметр("Занятие", Занятие);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.СтатусЗанятия;
	Иначе
		Возврат Перечисления.СтатусыЗанятий.НеПодтверждено;
	КонецЕсли;
	
КонецФункции

Функция НайтиСтатусЗанятия(Занятие) Экспорт

	Запрос = Новый Запрос ("ВЫБРАТЬ
	                       |	КОЛИЧЕСТВО(*) КАК ЕстьЗаписи
	                       |ИЗ
	                       |	РегистрСведений.СтатусыЗанятий КАК СтатусыЗанятий
	                       |ГДЕ
	                       |	СтатусыЗанятий.Занятие = &Занятие");
	Запрос.УстановитьПараметр("Занятие", Занятие);
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.ЕстьЗаписи;
	КонецЕсли;
	
КонецФункции

Функция ЗаписатьСтатусЗанятия(Занятие, СтатусЗанятия) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.Занятие = Занятие;
	Запись.СтатусЗанятия = СтатусЗанятия;
	Запись.Записать();
	
КонецФункции
